---
kind: type
id: T:Autodesk.Revit.DB.Structure.Truss
zh: 桁架
source: html/e0cdc591-cac6-57c7-6190-f0d48cc0e4a9.htm
---
# Autodesk.Revit.DB.Structure.Truss

**中文**: 桁架

Represents all kinds of Trusses.

## Syntax (C#)
```csharp
public class Truss : Element
```

## Remarks
The Truss object represents all the kinds of Trusses in Revit.
 The TrussType property is used to distinguish the type of the Truss.